In [2]:
import pandas as pd
from pandas import read_html
import html5lib
import requests
import json
import numpy as np
import matplotlib.pyplot as plt
from unicodedata import normalize

In [3]:
mlb_table = pd.read_html("https://questionnaire-148920.appspot.com/swe/data.html")

In [4]:
df = mlb_table[0]
df.head()

              Player       Salary  Year Level
0        Abreu, Jose  $11,666,667  2016   MLB
1    Acevedo, Andury     $507,500  2016   MLB
2     Ackley, Dustin   $3,200,000  2016   MLB
3  Adames, Cristhian     $507,500  2016   MLB
4      Adams, Austin     $507,500  2016   MLB

In [5]:
df['Salary']= df.Salary.apply(lambda x:''+ str(x).replace('$','') if x else x)

In [6]:
df['Salary']= df.Salary.apply(lambda x:''+ str(x).replace(',','') if x else x)

In [7]:
df.dropna()

                  Player    Salary  Year Level
0            Abreu, Jose  11666667  2016   MLB
1        Acevedo, Andury    507500  2016   MLB
2         Ackley, Dustin   3200000  2016   MLB
3      Adames, Cristhian    507500  2016   MLB
4          Adams, Austin    507500  2016   MLB
...                  ...       ...   ...   ...
1203     Zimmerman, Ryan  14000000  2016   MLB
1204  Zimmermann, Jordan  18000000  2016   MLB
1205        Zobrist, Ben  10500000  2016   MLB
1206        Zunino, Mike    507500  2016   MLB
1207          Zych, Tony    507500  2016   MLB

[1208 rows x 4 columns]

In [8]:
index = df[df['Salary'] == '$no salary data'].index
df.drop(index, inplace=True)

In [13]:
index = df[df['Salary'] == 'no salary data'].index
df.drop(index, inplace=True)

In [9]:
index = df[df['Salary'] == '$nan'].index
df.drop(index, inplace=True)

In [10]:
index = df[df['Salary'] == 'nan'].index
df.drop(index, inplace=True)

#confirm data types

In [178]:
df.dtypes

Player    object
Salary    object
Year       int64
Level     object
dtype: object

#change data type to float

In [193]:
df['Salary'].astype('float')

0       11666667.0
1         507500.0
2        3200000.0
3         507500.0
4         507500.0
           ...
1203    14000000.0
1204    18000000.0
1205    10500000.0
1206      507500.0
1207      507500.0
Name: Salary, Length: 1163, dtype: float64

#List of top players by 125 Salary

In [15]:
df.Salary = df.Salary.astype('float')
df.sort_values('Salary', ascending=False)[:125]

                  Player      Salary  Year Level
583     Kershaw, Clayton  34571429.0  2016   MLB
449        Greinke, Zack  34000000.0  2016   MLB
871         Price, David  30000000.0  2016   MLB
471       Hamilton, Josh  28410000.0  2016   MLB
159      Cabrera, Miguel  28000000.0  2016   MLB
...                  ...         ...   ...   ...
1057  Strasburg, Stephen  10400000.0  2016   MLB
476           Happ, J.A.  10000000.0  2016   MLB
322   Encarnacion, Edwin  10000000.0  2016   MLB
517       Holland, Derek  10000000.0  2016   MLB
257          Darvish, Yu  10000000.0  2016   MLB

[125 rows x 4 columns]

# Average of the 125 highest salaries from the past season

In [208]:
df.Salary = df.Salary.astype('float')
df.sort_values('Salary', ascending=False).Salary[:125].mean()

16343470.336

#Median Salary of top 125 players

In [214]:
df.Salary = df.Salary.astype('float')
df.sort_values('Salary', ascending=False).Salary[:125].median()

15000000.0

#top 10 out of top 125 players salaries

In [219]:
df.Salary = df.Salary.astype('float')
df.sort_values('Salary', ascending=False)[:10]

               Player      Salary  Year Level
583  Kershaw, Clayton  34571429.0  2016   MLB
449     Greinke, Zack  34000000.0  2016   MLB
871      Price, David  30000000.0  2016   MLB
471    Hamilton, Josh  28410000.0  2016   MLB
159   Cabrera, Miguel  28000000.0  2016   MLB
499  Hernandez, Felix  25857143.0  2016   MLB
970      Sabathia, CC  25000000.0  2016   MLB
874    Pujols, Albert  25000000.0  2016   MLB
626       Lester, Jon  25000000.0  2016   MLB
526      Howard, Ryan  25000000.0  2016   MLB

#Average salary of the top 10 players within the top 125 salaries

In [218]:
df.Salary = df.Salary.astype('float')
df.sort_values('Salary', ascending=False).Salary[:10].mean()

28083857.2

#Last 10 salaries of the top 125 players

In [220]:
df.Salary = df.Salary.astype('float')
df.sort_values('Salary', ascending=False)[115:125]

                  Player      Salary  Year Level
1152        Walker, Neil  10550000.0  2016   MLB
1205        Zobrist, Ben  10500000.0  2016   MLB
1057  Strasburg, Stephen  10400000.0  2016   MLB
476           Happ, J.A.  10000000.0  2016   MLB
257          Darvish, Yu  10000000.0  2016   MLB
517       Holland, Derek  10000000.0  2016   MLB
580      Kendrick, Howie  10000000.0  2016   MLB
322   Encarnacion, Edwin  10000000.0  2016   MLB
146   Bumgarner, Madison   9950000.0  2016   MLB
639         Loney, James   9666667.0  2016   MLB

#Average salary of the bottom 10 players within the top 125 salaries

In [211]:
df.Salary = df.Salary.astype('float')
df.sort_values('Salary', ascending=False).Salary[115:125].mean()

10106666.7

In [ ]:
--------------------------------------------------------------------

In [ ]:
##Cited resources

In [ ]:
https://pbpython.com/pandas-html-table.html
https://stackoverflow.com/questions/41329031/python-pandas-how-to-get-top-n-values-and-the-sum-of-all-other-values
https://stackoverflow.com/questions/47914274/pandas-sort-values-does-not-sort-numbers-correctly